<?php
// $text = " hello IN dsfsf";


// echo str_replace("" , "" ," " ,"" ,);
// echo preg_replace('/in/i', "to", $text);

// i -> capital or small
// m -> بحيث في سطور متعدده و تكون في البدايه او النهايه
// u -> طابق حسب ال ut8
// ^ -. >في البدايه فقط
// * ->
// $ -> في النهايه

// .: يطابق أي حرف واحد (باستثناء الخطوط الجديدة).
// ^: يطابق بداية السلسلة (عند استخدامه خارج الأقواس).
// $: يطابق نهاية السلسلة.
// |: يعني "أو" (OR)، يطابق أي من الأنماط المفصولة به. مثال: cat|dog يطابق "cat" أو "dog".
// (): يُستخدم لتجميع جزء من النمط، ويمكن استخدامه لتطبيق المضاعفات على مجموعة كاملة، أو للتقاط المجموعات (capturing groups).
// []: يحدد مجموعة من الأحرف، يطابق أي حرف من المجموعة. مثال: [abc] يطابق "a" أو "b" أو "c".
// [^]: نفي المجموعة، يطابق أي حرف غير الأحرف المحددة. مثال: [^abc] يطابق أي حرف باستثناء "a"، "b"، "c".
// -: يُستخدم داخل الأقواس لتحديد نطاق (Range). مثال: [a-z] يطابق أي حرف من "a" إلى "z".
// \: علامة الهروب (Escape)، تُستخدم لإلغاء المعنى الخاص للرموز. مثال: \. يطابق النقطة بشكل حرفي، بدلاً من أي


// \d: يطابق أي رقم (معادل لـ [0-9]).
// \D: يطابق أي حرف غير رقمي.
// \s: يطابق أي فراغ (space، tab، newline، إلخ.).
// \S: يطابق أي حرف غير فراغ.
// \w: يطابق أي حرف كلمة (أحرف، أرقام، underscore).
// \W: يطابق أي حرف غير كلمة.
// \b: حد الكلمة (word boundary)، يطابق الموقع بين حرف كلمة وغير حرف كلمة.
// \B: عكس \b， يطابق الموقع غير الحدود.
// \uxxxx: يطابق حرف Unicode بالترميز السداسي xxxx.
// ج. المضاعفات (Quantifiers)





// *: يطابق صفر أو أكثر من المطابقات السابقة. مثال: a* يطابق "" (سلسلة فارغة)، "a"، "aa"، إلخ.
// +: يطابق واحد أو أكثر. مثال: a+ يطابق "a"، "aa"، "aaa"، إلخ.
// ?: يطابق صفر أو واحد. مثال: a? يطابق "" أو "a".
// {n}: يطابق بالضبط n مرات. مثال: a{3} يطابق "aaa".
// {n,}: يطابق على الأقل n مرات. مثال: a{2,} يطابق "aa"، "aaa"، إلخ.
// {n,m}: يطابق من n إلى m مرات. مثال: a{2,3} يطابق "aa" أو "aaa".




// $str = '123  4567';

// $pattern  = '/[a-zA-Z]/';

// echo preg_match( $pattern, $str); //-> بترجع true او faluse

//    /\b جمله/


// preg_split( )
